IsValidViewTemplate Method
 Verifies that the view represented by templateId can be set as the controlling view template for this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsValidViewTemplate(
	ElementId templateId
)
Visual Basic
Public Function IsValidViewTemplate ( _
	templateId As ElementId _
) As Boolean
Visual C++
public:
bool IsValidViewTemplate(
	ElementId^ templateId
)
Parameters
templateId
Type: Autodesk.Revit.DBElementId
 The id to be validated as a view template for this view.
Return Value
 True if the view is valid for us as a view template and compatible with this view, or if it is InvalidElementId, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →